docs/posts/2015-01-16-emacs-blog-test.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Blog Test</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Emacs Blog Test</h1>
<p class="subtitle" role="doc-subtitle">Jan 16, 2015</p>
</header><p>
I&rsquo;m testing blogging to the new Jekyll blog from Emacs using the Lisp code from <a href="https://www.miskatonic.org/2014/01/26/more-about-emacs-and-jekyll/%20">William Denton</a>.
It works extremely well. I had to remap the key definitions since <code>C-c j</code> was already used for something else in my configuration. It&rsquo;s bad Emacs form, but I used <code>C-x j</code> instead. So, <code>C-x j n</code> asks for a post title, then creates a file in the drafts folder with the front matter already inserted. When ready to publish, <code>C-x j t</code> inserts the time stamp, and <code>C-x j p</code> renames the file using the time stamp and moves it into the posts folder. <code>C-x j o</code> opens the site folder in a dired buffer.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
